{
  "metadata": {
    "total_size": 32815315552
  },
  "weight_map": {
    "language_model.lm_head.weight": "model-00005-of-00007.safetensors",
    "language_model.model.embed_tokens.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.input_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.mlp.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.mlp.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.mlp.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.post_attention_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.kv_a_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.kv_a_proj_with_mqa.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.kv_b_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.o_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.q_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.0.self_attn.rotary_emb.inv_freq": "model-00001-of-00007.safetensors",
    "language_model.model.layers.1.input_layernorm.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.0.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.0.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.0.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.1.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.1.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.1.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.10.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.10.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.10.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.11.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.11.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.11.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.12.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.12.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.12.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.13.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.13.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.13.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.14.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.14.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.14.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.15.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.15.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.15.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.16.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.16.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.16.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.17.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.17.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.17.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.18.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.18.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.18.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.19.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.19.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.19.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.2.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.2.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.2.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.20.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.20.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.20.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.21.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.21.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.21.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.22.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.22.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.22.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.23.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.23.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.23.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.24.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.24.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.24.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.25.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.25.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.25.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.26.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.26.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.26.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.27.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.27.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.27.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.28.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.28.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.28.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.29.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.29.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.29.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.3.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.3.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.3.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.30.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.30.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.30.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.31.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.31.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.31.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.32.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.32.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.32.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.33.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.33.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.33.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.34.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.34.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.34.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.35.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.35.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.35.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.36.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.36.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.36.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.37.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.37.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.37.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.38.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.38.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.38.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.39.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.39.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.39.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.4.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.4.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.4.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.40.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.40.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.40.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.41.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.41.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.41.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.42.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.42.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.42.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.43.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.43.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.43.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.44.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.44.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.44.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.45.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.45.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.45.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.46.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.46.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.46.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.47.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.47.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.47.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.48.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.48.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.48.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.49.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.49.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.49.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.5.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.5.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.5.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.50.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.50.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.50.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.51.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.51.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.51.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.52.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.52.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.52.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.53.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.53.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.53.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.54.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.54.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.54.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.55.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.55.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.55.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.56.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.56.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.56.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.57.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.57.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.57.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.58.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.58.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.58.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.59.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.59.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.59.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.6.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.6.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.6.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.60.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.60.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.60.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.61.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.61.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.61.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.62.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.62.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.62.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.63.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.63.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.63.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.7.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.7.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.7.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.8.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.8.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.8.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.9.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.9.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.experts.9.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.gate.e_score_correction_bias": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.gate.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.shared_experts.down_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.shared_experts.gate_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.mlp.shared_experts.up_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.post_attention_layernorm.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.kv_a_layernorm.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.kv_a_proj_with_mqa.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.kv_b_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.o_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.q_proj.weight": "model-00003-of-00007.safetensors",
    "language_model.model.layers.1.self_attn.rotary_emb.inv_freq": "model-00003-of-00007.safetensors",
    "language_model.model.layers.10.input_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.0.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.0.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.0.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.1.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.1.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.1.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.10.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.10.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.10.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.11.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.11.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.11.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.12.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.12.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.12.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.13.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.13.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.13.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.14.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.14.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.14.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.15.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.15.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.15.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.16.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.16.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.16.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.17.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.17.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.17.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.18.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.18.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.18.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.19.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.19.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.19.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.2.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.2.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.2.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.20.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.20.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.20.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.21.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.21.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.21.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.22.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.22.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.22.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.23.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.23.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.23.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.24.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.24.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.24.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.25.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.25.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.25.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.26.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.26.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.26.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.27.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.27.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.27.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.28.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.28.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.28.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.29.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.29.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.29.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.3.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.3.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.3.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.30.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.30.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.30.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.31.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.31.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.31.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.32.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.32.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.32.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.33.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.33.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.33.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.34.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.34.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.34.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.35.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.35.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.35.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.36.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.36.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.36.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.37.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.37.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.37.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.38.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.38.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.38.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.39.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.39.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.39.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.4.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.4.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.4.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.40.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.40.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.40.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.41.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.41.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.41.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.42.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.42.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.42.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.43.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.43.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.43.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.44.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.44.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.44.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.45.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.45.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.45.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.46.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.46.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.46.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.47.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.47.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.47.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.48.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.48.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.48.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.49.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.49.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.49.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.5.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.5.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.5.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.50.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.50.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.50.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.51.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.51.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.51.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.52.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.52.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.52.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.53.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.53.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.53.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.54.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.54.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.54.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.55.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.55.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.55.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.56.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.56.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.56.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.57.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.57.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.57.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.58.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.58.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.58.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.59.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.59.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.59.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.6.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.6.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.6.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.60.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.60.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.60.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.61.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.61.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.61.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.62.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.62.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.62.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.63.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.63.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.63.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.7.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.7.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.7.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.8.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.8.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.8.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.9.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.9.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.experts.9.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.gate.e_score_correction_bias": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.gate.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.shared_experts.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.shared_experts.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.mlp.shared_experts.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.post_attention_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.kv_a_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.kv_a_proj_with_mqa.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.kv_b_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.o_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.q_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.10.self_attn.rotary_emb.inv_freq": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.input_layernorm.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.0.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.0.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.0.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.1.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.1.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.1.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.10.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.10.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.10.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.11.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.11.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.11.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.12.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.12.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.12.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.13.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.13.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.13.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.14.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.14.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.14.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.15.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.15.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.15.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.16.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.16.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.16.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.17.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.17.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.17.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.18.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.18.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.18.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.19.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.19.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.19.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.2.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.2.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.2.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.20.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.20.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.20.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.21.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.21.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.21.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.22.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.22.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.22.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.23.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.23.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.23.up_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.24.down_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.24.gate_proj.weight": "model-00001-of-00007.safetensors",
    "language_model.model.layers.11.mlp.experts.24.up_proj.weight": "model-00001-of-00007.safetensors",
