{
  "anyres": true,
  "architectures": [
    "ValleyQwen2ForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "modeling_valley.ValleyConfig",
    "AutoModel": "modeling_valley.CustomValleyQwen2ForCausalLM",
    "AutoModelForCausalLM": "modeling_valley.CustomValleyQwen2ForCausalLM"
  },
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eagle_vision_tower": "Qwen/Qwen2-VL-7B-Instruct",
  "eos_token_id": 151645,
  "frame_max_pixels": 153664,
  "grid_pinpoints": "(1x1),...,(3x3)",
  "hidden_act": "silu",
  "hidden_size": 3584,
  "image_aspect_ratio": null,
  "image_grid_pinpoints": null,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "language": "english",
  "llm_name": "qwen2",
  "max_pixels": 571536,
  "max_position_embeddings": 32768,
  "max_tile_num": 9,
  "max_vision_token": 100000,
  "max_window_layers": 28,
  "min_tile_num": 1,
  "mlp_hidden_dim": 32000,
  "mm_hidden_size": 1152,
  "mm_projector_type": "ovis_conv_adapter",
  "mm_use_im_patch_token": false,
  "mm_use_im_start_end": false,
  "mm_vision_select_feature": "cls_patch",
  "mm_vision_select_layer": -2,
  "mm_vision_siglip_select_layer": -1,
  "mm_vision_tower": "google/siglip-so400m-patch14-384",
  "model_type": "valley",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "num_patches_per_side": 14,
  "only_crop_single_image": true,
  "pixelshuffle_downsample_ratio": 3,
  "pool_out_size": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "tokenize_function": "softmax",
  "torch_dtype": "bfloat16",
  "training_stage": "stage2",
  "transformers_version": "4.45.2",
  "tune_mm_mlp_adapter": true,
  "use_cache": true,
  "use_sliding_window": false,
  "use_special_start_end_token": true,
  "vit_crop_size": 384,
  "vit_patch_size": 14,
  "vocab_size": 151679
}
