{
  "</bbox>": 151673,
  "</char>": 151669,
  "</obj>": 151671,
  "</tool_call>": 151658,
  "<bbox>": 151672,
  "<char>": 151668,
  "<delim>": 151674,
  "<gro>": 151666,
  "<image>": 151675,
  "<obj>": 151670,
  "<ocr>": 151667,
  "<tool_call>": 151657,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652,
  "[UNK]": 151665
}
