{
  "</CAPTION>": 151674,
  "</CONCLUSION>": 151678,
  "</REASONING>": 151676,
  "</SUMMARY>": 151672,
  "</tool_call>": 151658,
  "<CAPTION>": 151673,
  "<CONCLUSION>": 151677,
  "<REASONING>": 151675,
  "<SUMMARY>": 151671,
  "<\\cor>": 151670,
  "<cor>": 151669,
  "<im_end>": 151666,
  "<im_start>": 151665,
  "<tool_call>": 151657,
  "<vi_end>": 151668,
  "<vi_start>": 151667,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
