{
  "additional_special_tokens": [
    "<SUMMARY>",
    "</SUMMARY>",
    "<CAPTION>",
    "</CAPTION>",
    "<REASONING>",
    "</REASONING>",
    "<CONCLUSION>",
    "</CONCLUSION>"
  ],
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
