{
  "architectures": [
    "HfMoondream"
  ],
  "auto_map": {
    "AutoConfig": "hf_moondream.HfConfig",
    "AutoModelForCausalLM": "hf_moondream.HfMoondream"
  },
  "config": {},
  "model_type": "moondream1",
  "torch_dtype": "float16",
  "transformers_version": "4.44.0"
}
