{
  "_commit_hash": null,
  "architectures": [
    "POINTSV15ChatModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_pointsv15_chat.POINTSV15ChatConfig",
    "AutoModelForCausalLM": "modeling_pointsv15_chat.CustomPOINTSV15ChatModel"
  },
  "llm_config": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "auto_map": {
      "AutoConfig": "configuration_llama.CustomLlamaConfig",
      "AutoModelForCausalLM": "modeling_llama.RCACustomLlamaForCausalLM"
    },
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": 0,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": [
      2,
      3
    ],
    "exponential_decay_length_penalty": null,
    "ffn_hidden_size": 18944,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "swiglu",
    "hidden_size": 3584,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layernorm_epsilon": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "max_position_embeddings": 16384,
    "min_length": 0,
    "mlp_fc1_bias": false,
    "mlp_fc2_bias": false,
    "model_type": "custom_llama",
    "no_repeat_ngram_size": 0,
    "norm_type": "rms_norm",
    "num_attention_heads": 28,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_hidden_layers": 28,
    "num_kv_heads": 4,
    "num_layers": 28,
    "num_return_sequences": 1,
    "out_proj_bias": false,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_proj_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "rotary_compress": 1.0,
    "rotary_emb_base": 1000000.0,
    "rotary_pct": 1.0,
    "sep_token_id": null,
    "share_kv_num_layers": 1,
    "sliding_window_size": -1,
    "sliding_window_type": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": false,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.46.3",
    "typical_p": 1.0,
    "use_bfloat16": false,
    "use_cache": true,
    "use_gqa": true,
    "vocab_size": 152064
  },
  "torch_dtype": "bfloat16",
  "transformers_version": null,
  "vision_config": {
    "_attn_implementation_autoset": false,
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depth": 32,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "embed_dim": 1280,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "quick_gelu",
    "hidden_size": 3584,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "in_channels": 3,
    "in_chans": 3,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 4,
    "model_type": "qwen2_vl",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_heads": 16,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 14,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "temporal_patch_size": 2,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": "bfloat16",
    "torchscript": false,
    "transformers_version": "4.46.3",
    "typical_p": 1.0,
    "use_bfloat16": false
  }
}
