{
  "metadata": {
    "total_size": 16671902720
  },
  "weight_map": {
    "llm.embed_out.weight": "model-00004-of-00004.safetensors",
    "llm.lm.embed_in.weight": "model-00001-of-00004.safetensors",
    "llm.lm.final_layer_norm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.0.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.0.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.1.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.10.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.10.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.11.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.12.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.13.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.14.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.15.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.16.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.17.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.18.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.18.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.19.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.19.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.2.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.2.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.20.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.20.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.21.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.22.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.23.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.24.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.25.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.26.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.attention.dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.attention.key_value_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.attention.key_value_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.attention.query_dense.bias": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.attention.query_dense.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.input_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.mlp.dense_4h_to_h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.mlp.dense_h_to_4h.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.27.post_attention_layernorm.weight": "model-00003-of-00004.safetensors",
    "llm.lm.layers.3.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.3.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.4.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.5.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.6.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.mlp.dense_4h_to_h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.mlp.dense_h_to_4h.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.7.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.attention.dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.attention.key_value_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.attention.key_value_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.attention.query_dense.bias": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.attention.query_dense.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.input_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.8.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.8.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.8.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
    "llm.lm.layers.9.attention.dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.attention.key_value_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.attention.key_value_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.attention.query_dense.bias": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.attention.query_dense.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.input_layernorm.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.mlp.dense_4h_to_h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.mlp.dense_h_to_4h.weight": "model-00002-of-00004.safetensors",
    "llm.lm.layers.9.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
    "vision_encoder.blocks.0.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.0.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.1.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.10.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.11.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.12.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.13.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.14.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.15.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.16.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.17.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.18.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.19.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.2.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.20.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.21.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.22.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.23.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.24.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.25.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.26.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.27.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.28.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.29.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.3.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.30.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.31.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.4.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.attn.qkv.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.attn.qkv.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.mlp.fc1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.mlp.fc1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.mlp.fc2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.mlp.fc2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.norm1.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.norm1.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.norm2.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.5.norm2.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.6.attn.proj.bias": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.6.attn.proj.weight": "model-00004-of-00004.safetensors",
    "vision_encoder.blocks.6.attn.qkv.bias": "model-00004-of-00004.safetensors",
